{
    "studentTips":[
        {
            "text":"I've noticed the bulletin board gets updated with new things to do every day!"
        },
        {
            "text":"I feel like joining clubs is a really good way to learn new skills-- I've found so many ways to spend my time through hobbies I've picked up from clubs!"
        },
        {
            "text":"When I keep my living space clean and tidy I feel like it is so much easier to focus."
        },
        {
            "text":"Establishing even small daily habits goes a long way to helping you stay motivated in other areas of your life"
        },
        {
            "text":"I like keeping a water bottle with me throughout the day-- staying hydrated seems to help me focus"
        },
        {
            "text":"I like to check my email every morning-- one time I didn't and I didn't realize class had been cancelled until I got to the classroom! :("
        },
        {
            "text":"I have a calendar where I keep track of when all my assignments are due."
        },
        {
            "text":"I've found myself putting every activity I want to do in a reminder app on my phone, it's sometimes easy to forget everything that's going on around campus without the reminders!"
        },
        {
            "text":"The career center has really helpful advice about resumes and future job prospects!"
        },
        {
            "text":"I like to check in with my friends and see how they're doing and so they don't forget I exist :)"
        },
        {
            "text":"Me and my roommate get along so well! It's nice taking time to do activites with her outside the dorm room, such as getting coffee together or going to the gym"
        },
        {
            "text":"If you haven't heard from a friend in awhile, it could be fun to invite them to do something with you around campus! (like get food, or study perhaps?)"
        },
        {
            "text":"I like making friends in classes and at least being on friendly terms with the person I'm sitting next to. Study buddies are nice to have!"
        },
        {
            "text":"If you're at a social event or have some downtime, striking up a conversation with someone who doesn't seem busy can be a good way to make a new friend!"
        },
        {
            "text":"I had an internship last summer. They offered me a full time job for when I graduate!"
        },
        {
            "text":"I would totally recommend applying to as many internships as you can find online-- if you get one in your field it looks great on your professional resume!"
        },
        {
            "text":"Whenever I go back to my room I always put my key in the same place where I'll remember where it is-- I kept losing it in my room otherwise!"
        },
        {
            "text":"My laptop is really low on battery... I should've brought my charger with me."
        },
        {
            "text":"I like sitting in the academic longue during gaps between classes to work on my homework."
        },
        {
            "text":"I have a flashcard app on my phone which makes studying quite convenient when I don't have anything else to do."
        },
        {
            "text":"It's always nice going to office hours and chatting with my professors, especially when I'm feeling a little overwhelmed or unsure of where to start with homework."
        }
    ]
}